app/views/students/_search_form.html.erb

SELECT "students".* FROM "students" WHERE "students"."major" = ?  [["major", "Computer Engineering BS"]]
---
      <%= form.label :major, "Select Major", class: "form-label" %>
      <%= form.select :major, options_for_select(Student::VALID_MAJORS), { prompt: "Any Major" }, name: 'search[major]', class: "form-control" %>