app/controllers/students_controller.rb

  def index
    Rails.logger.info "Params: #{params.inspect}"

    @search_params = params[:search] || {}
    @students = Student.all

    Rails.logger.info "Search Params: #{@search_params.inspect}"

    if @search_params[:major].present?
      @students = @students.where(major: @search_params[:major])
---
SELECT "students".* FROM "students"
SELECT "students".* FROM "students" WHERE "students"."major" = ?  [["major", "Computer Engineering BS"]]

  def create
    @student = Student.new(student_params)

    respond_to do |format|
     if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "school_email", "major", "minor", "graduation_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "major" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["major", "Computer Engineering BS"], ["updated_at", "2024-10-08 18:41:04.665897"], ["id", 2]]

  def destroy
    @student.destroy!
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]